Repository: isaacszf/CookBook-API
Catalog: src/Shared/Exceptions/ResourceMessageException.*.resx
Languages: pt_br

# NAME_EMPTY
source: The name cannot be empty!
pt_br: O nome não pode estar vazio!

# EMAIL_EMPTY
source: The e-mail cannot be empty!
pt_br: O e-mail não pode estar vazio!

# EMAIL_INVALID
source: The e-mail is invalid!
pt_br: O e-mail está inválido!

# PASSWORD_INVALID
source: The password has to be at least 6 characters long!
pt_br: A senha deve conter pelo menos 6 caracteres!

# UNKNOWN_ERR
source: Unknown Error. Try again later..
pt_br: Erro desconhecido. Tente novamente mais tarde.

# EMAIL_IN_USE
source: E-mail is already being used!
pt_br: E-mail já foi registrado!

# INVALID_LOGIN
source: Invalid e-mail/password
pt_br: E-mail e/ou senha inválidos!

# NO_TOKEN
source: There is no access token!
pt_br: Token de acesso inexistente!

# USER_WITHOUT_PERMISSION
source: User do not have permission to access this resource!
pt_br: Usuário não tem permissão para acessar esse endpoint!

# PASSWORD_EQUAL
source: The passwords cannot be the same!
pt_br: As senhas não podem ser iguais!

# PASSWORD_DOES_NOT_MATCH
source: Given user password is incorrect!
pt_br: A senha está incorreta!

# RECIPE_TITLE_EMPTY
source: Recipe's title cannot be empty!
pt_br: O título da receita não pode ser vazio!

# COOKING_TIME_INVALID
source: "CookingTime" is invalid!
pt_br: "CookingTime" está inválido!

# COOKING_DIFFICULTY_INVALID
source: "CookingDifficulty" is invalid!
pt_br: "CookingDifficulty" está inválido!

# AT_LEAST_ONE_INGREDIENT
source: Recipe needs to have at least one ingredient
pt_br: A receita precisa conter no mínimo um ingrediente

# INVALID_DISH_TYPE
source: Dish type does not exist
pt_br: Tipo de prato não existe

# AT_LEAST_ONE_INSTRUCTION
source: Recipe needs to have at least one ingredient
pt_br: A receita precisa conter no mínimo uma instrução

# INVALID_STEP
source: Step cannot be negative
pt_br: O número da instrução não pode ser negativo

# INSTRUCTION_EMPTY
source: Field "instruction" cannot be empty
pt_br: Campo "Instrução" não pode ser vazio

# INSTRUCTION_EXCEEDS_LIMIT
source: Instruction length cannot be greater than 2000
pt_br: Instrução passa de 2000 caracteres

# SAME_INSTRUCTION_ORDER
source: Its not possible to create two insctructions with the same step
pt_br: Não é possível criar uma receita com dois passos iguais
